package main

// Порядковый номер задания на курсе: 2
// Номер задачи из задания: 9
// Краткое название: метод, который "переворачивает" порядок элементов в связном списке, меняя его на противоположный.
// Сложность по времени: O()
// Сложность по памяти: O()
func ReverseList(l *LinkedList2) *LinkedList2 {
	return &LinkedList2{}
}

// Номер задачи из задания: 10
// Краткое название: булев метод, который сообщает, имеются ли циклы (замкнутые на себя по кругу) внутри списка.
// Сложность по времени: O()
// Сложность по памяти: O()
func HasCycle(l *LinkedList2) bool {
	return false
}

// Номер задачи из задания: 11
// Краткое название: метод, сортирующий список.
// Сложность по времени: O()
// Сложность по памяти: O()
func SortList(l *LinkedList2) *LinkedList2 {
	return &LinkedList2{}
}

// Номер задачи из задания: 12
// Краткое название: метод, объединяющий два списка в третий.
// Сложность по времени: O()
// Сложность по памяти: O()
func MergeLists(first *LinkedList2, second *LinkedList2) *LinkedList2 {
	return &LinkedList2{}
}


